//New Malware Import Template

// !!! ------ DELIVERY DETAILS ------ !!!
CREATE UNIQUE (dv:Delivery_Vector { name: '_DELIVERY_VECTOR_NAME_' }) RETURN dv.name;
CREATE UNIQUE (se:Service { name: '_SERVICE_NAME_' }) RETURN se.name;
CREATE UNIQUE (st:ServiceType { name: '_NAME_' }) RETURN st.name;

//Delivery of ex relationship
MATCH (dv:Deliver_Vector),(ex:Exploit)
WHERE dv.name = '_Deliver_Vector_NAME_' AND ex.name = '_EXPLOIT_NAME_'
CREATE UNIQUE (dv) - [r:EXPOSES] -> (ex)
RETURN r

//Service provides delivery vector
MATCH (se:Service),(dv:Deliver_Vector)
WHERE se.name = '_SERVICE_NAME_' AND dv.name = '_DELIVERY_VECTOR_'
CREATE UNIQUE (se) - [r:PROVIDES] -> (dv)
RETURN r

//Service Types related to Services
MATCH (st:ServiceType),(se:Service)
WHERE st.name = '_SERVICE_NAME_' AND dv.name = se.name = '_SERVICE_NAME_'
CREATE UNIQUE (st) - [r:PROVIDES] -> (se)
RETURN r

// !!! ------ PAYLOAD DETAILS ------ !!!
CREATE UNIQUE (pa:Payload { name: '_NAME_' }) RETURN pa.name;
CREATE UNIQUE (vu:Vulnerability) { id: '_NAME_', date_disclosed: 'YYYY-MM-DD', description: "VULN_DESCRIPTION" }) RETURN vu.name;
CREATE UNIQUE (is:Intel_Source { name: '_NAME_' }, url: '_URL_' ) RETURN is.name;
CREATE UNIQUE (mo:Motive { name: '_NAME_' }) RETURN mo.name;
CREATE UNIQUE (sa:Sample { hash: '_HASH_' }, hash_type) RETURN sa.hash;

//Exploit Payload relationship
MATCH (ex:Exploit),(pa:Payload)
WHERE ex.name = '_EXPLOIT_NAME_' AND pa.name = '_PAYLOAD_NAME_'
CREATE UNIQUE (ex) - [r:DELIVERS] -> (pa)
RETURN r

//Intel -> Payload relationship
MATCH (in:Intel), (pa:Payload)
WHERE in.name = '_INTEL_NAME_' AND pa.payload = '_PAYLOAD_NAME_'
CREATAE (in) - [r:REPORTS] -> (pa)
RETURN r

//Payload Motive relationship
MATCH (pa:Payload),(mo:Motive)
WHERE pa.name = '_PAYLOAD_NAME_' AND mo.name ='_MOTIVE_'
CREATE UNIQUE (pa) - [r:USES] -> (mo)
RETURN r

//Payload Vuln relationship
MATCH (pa:Payload),(vu:Vulnerability)
WHERE pa.name = '_PAYLOAD_NAME_' AND vu.id ='_VULNERABILITY_ID_'
CREATE UNIQUE (pa) - [r:EXPLOITS] -> (vu)
RETURN r

//Sample of Payload relationship
MATCH (sa:Sample), (pa:Payload)
WHERE sa.hash = '_HASH_' AND pa.name = '_PAYLOAD_NAME_'
CREATE UNIQUE (sa) - [r:EXAMPLE] -(pa)
RETURN r

// !!! ------ EXPLOIT DETAILS ------ !!!
CREATE UNIQUE (ex:Exploit { name: '_NAME_' }) RETURN ex.name;
CREATE UNIQUE (vu:Vulnerability) { id: '_NAME_', date_disclosed: 'YYYY-MM-DD', description: "VULN_DESCRIPTION" }) RETURN vu.name;
CREATE UNIQUE (is:Intel_Source { name: '_NAME_' }, url: '_URL_' ) RETURN is.name;
CREATE UNIQUE (sa:Sample { hash: '_HASH_' }, hash_type) RETURN sa.hash;

//Exploit Vuln relationship
MATCH (ex:Exploit),(vu:Vulnerability)
WHERE ex.name = '_EXPLOIT_NAME_' AND vu.id = '_VULNERABILITY_ID_'
CREATE UNIQUE (ex) - [r:EXPLOITS] -> (vu)
RETURN r

//Intel -> Exploit relationship
MATCH (in:Intel), (ex:Exploit)
WHERE in.name = '_INTEL_NAME_' AND ex.name = '_EXPLOIT_NAME_'
CREATAE (in) - [r:REPORTS] -> (ex)
RETURN r

//Sample of Exploit relationship
MATCH (sa:Sample), (ex:Exploit)
WHERE sa.hash = '_HASH_' AND ex.name = '_EXPLOIT_NAME_'
CREATE UNIQUE (sa) - [r:EXAMPLE] -(ex)
RETURN r